stress_log/hdd_stress.log
==========   硬盘读写测试    2022-01-06 04:09:33   ==============


没有raid，不需要组建raid卡
系统盘为>> sda
一共有4非系统盘
非系统盘为>> 
['/dev/sdb', '/dev/sdc', '/dev/sdd', '/dev/sde']
========== 硬盘读写测试  2022-01-06 04:09:33  ================
开始第1个非系统盘的读写
命令->>> fio -filename=/dev/sdb -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_1

mytest_1: (g=0): rw=randrw, bs=16K-16K/16K-16K/16K-16K, ioengine=psync, iodepth=1
...
fio-2.16
Starting 10 threads

mytest_1: (groupid=0, jobs=10): err= 0: pid=28733: Thu Jan  6 04:09:53 2022
  read : io=4201.4MB, bw=215099KB/s, iops=13443, runt= 20001msec
    clat (usec): min=87, max=2894, avg=509.08, stdev=135.49
     lat (usec): min=87, max=2894, avg=509.15, stdev=135.49
    clat percentiles (usec):
     |  1.00th=[  302],  5.00th=[  342], 10.00th=[  370], 20.00th=[  406],
     | 30.00th=[  434], 40.00th=[  458], 50.00th=[  482], 60.00th=[  510],
     | 70.00th=[  548], 80.00th=[  596], 90.00th=[  692], 95.00th=[  772],
     | 99.00th=[  900], 99.50th=[  948], 99.90th=[ 1080], 99.95th=[ 1512],
     | 99.99th=[ 2608]
  write: io=4201.2MB, bw=215089KB/s, iops=13443, runt= 20001msec
    clat (usec): min=56, max=756, avg=232.74, stdev=75.80
     lat (usec): min=56, max=756, avg=233.34, stdev=75.81
    clat percentiles (usec):
     |  1.00th=[   59],  5.00th=[   84], 10.00th=[  116], 20.00th=[  165],
     | 30.00th=[  197], 40.00th=[  223], 50.00th=[  245], 60.00th=[  266],
     | 70.00th=[  282], 80.00th=[  302], 90.00th=[  326], 95.00th=[  334],
     | 99.00th=[  354], 99.50th=[  358], 99.90th=[  370], 99.95th=[  414],
     | 99.99th=[  636]
    lat (usec) : 100=3.34%, 250=22.89%, 500=51.94%, 750=18.69%, 1000=3.04%
    lat (msec) : 2=0.09%, 4=0.02%
  cpu          : usr=0.56%, sys=2.07%, ctx=537764, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=268887/w=268875/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=4201.4MB, aggrb=215098KB/s, minb=215098KB/s, maxb=215098KB/s, mint=20001msec, maxt=20001msec
  WRITE: io=4201.2MB, aggrb=215089KB/s, minb=215089KB/s, maxb=215089KB/s, mint=20001msec, maxt=20001msec

Disk stats (read/write):
  sdb: ios=266096/266030, merge=0/0, ticks=133780/60482, in_queue=194159, util=98.97%
==========================================
开始第2个非系统盘的读写
命令->>> fio -filename=/dev/sdc -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_2

mytest_2: (g=0): rw=randrw, bs=16K-16K/16K-16K/16K-16K, ioengine=psync, iodepth=1
...
fio-2.16
Starting 10 threads

mytest_2: (groupid=0, jobs=10): err= 0: pid=29729: Thu Jan  6 04:10:14 2022
  read : io=4205.9MB, bw=215326KB/s, iops=13457, runt= 20001msec
    clat (usec): min=114, max=2976, avg=509.17, stdev=136.64
     lat (usec): min=114, max=2976, avg=509.24, stdev=136.64
    clat percentiles (usec):
     |  1.00th=[  302],  5.00th=[  342], 10.00th=[  370], 20.00th=[  406],
     | 30.00th=[  434], 40.00th=[  458], 50.00th=[  482], 60.00th=[  510],
     | 70.00th=[  548], 80.00th=[  596], 90.00th=[  700], 95.00th=[  780],
     | 99.00th=[  908], 99.50th=[  948], 99.90th=[ 1064], 99.95th=[ 1368],
     | 99.99th=[ 2640]
  write: io=4205.1MB, bw=215290KB/s, iops=13455, runt= 20001msec
    clat (usec): min=56, max=845, avg=231.89, stdev=75.68
     lat (usec): min=56, max=846, avg=232.49, stdev=75.69
    clat percentiles (usec):
     |  1.00th=[   59],  5.00th=[   83], 10.00th=[  115], 20.00th=[  165],
     | 30.00th=[  197], 40.00th=[  223], 50.00th=[  245], 60.00th=[  262],
     | 70.00th=[  282], 80.00th=[  302], 90.00th=[  322], 95.00th=[  334],
     | 99.00th=[  354], 99.50th=[  358], 99.90th=[  366], 99.95th=[  386],
     | 99.99th=[  516]
    lat (usec) : 100=3.43%, 250=23.07%, 500=51.82%, 750=18.46%, 1000=3.11%
    lat (msec) : 2=0.09%, 4=0.02%
  cpu          : usr=0.54%, sys=1.96%, ctx=538298, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=269171/w=269126/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=4205.9MB, aggrb=215326KB/s, minb=215326KB/s, maxb=215326KB/s, mint=20001msec, maxt=20001msec
  WRITE: io=4205.1MB, aggrb=215290KB/s, minb=215290KB/s, maxb=215290KB/s, mint=20001msec, maxt=20001msec

Disk stats (read/write):
  sdc: ios=267725/267690, merge=0/0, ticks=134648/60852, in_queue=195424, util=99.54%
==========================================
开始第3个非系统盘的读写
命令->>> fio -filename=/dev/sdd -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_3

mytest_3: (g=0): rw=randrw, bs=16K-16K/16K-16K/16K-16K, ioengine=psync, iodepth=1
...
fio-2.16
Starting 10 threads

mytest_3: (groupid=0, jobs=10): err= 0: pid=31478: Thu Jan  6 04:10:35 2022
  read : io=158112KB, bw=7850.3KB/s, iops=490, runt= 20141msec
    clat (usec): min=208, max=723521, avg=15462.04, stdev=39740.19
     lat (usec): min=208, max=723521, avg=15462.14, stdev=39740.19
    clat percentiles (usec):
     |  1.00th=[  278],  5.00th=[  326], 10.00th=[  382], 20.00th=[  506],
     | 30.00th=[ 1004], 40.00th=[ 1304], 50.00th=[ 1560], 60.00th=[ 2024],
     | 70.00th=[ 2672], 80.00th=[15808], 90.00th=[47872], 95.00th=[86528],
     | 99.00th=[197632], 99.50th=[246784], 99.90th=[387072], 99.95th=[419840],
     | 99.99th=[724992]
  write: io=155520KB, bw=7721.6KB/s, iops=482, runt= 20141msec
    clat (usec): min=153, max=314279, avg=4906.12, stdev=8506.35
     lat (usec): min=153, max=314279, avg=4906.76, stdev=8506.35
    clat percentiles (usec):
     |  1.00th=[  211],  5.00th=[  294], 10.00th=[  516], 20.00th=[ 1192],
     | 30.00th=[ 1880], 40.00th=[ 2608], 50.00th=[ 3504], 60.00th=[ 4512],
     | 70.00th=[ 6048], 80.00th=[ 7712], 90.00th=[ 9664], 95.00th=[11200],
     | 99.00th=[17280], 99.50th=[35584], 99.90th=[142336], 99.95th=[177152],
     | 99.99th=[313344]
    lat (usec) : 250=1.38%, 500=13.37%, 750=5.20%, 1000=3.09%
    lat (msec) : 2=22.66%, 4=19.09%, 10=19.53%, 20=6.16%, 50=4.46%
    lat (msec) : 100=2.94%, 250=1.87%, 500=0.23%, 750=0.01%
  cpu          : usr=0.02%, sys=0.09%, ctx=19602, majf=0, minf=19
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=9882/w=9720/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=158112KB, aggrb=7850KB/s, minb=7850KB/s, maxb=7850KB/s, mint=20141msec, maxt=20141msec
  WRITE: io=155520KB, aggrb=7721KB/s, minb=7721KB/s, maxb=7721KB/s, mint=20141msec, maxt=20141msec

Disk stats (read/write):
  sdd: ios=9963/9720, merge=0/0, ticks=152230/47550, in_queue=199991, util=99.03%
==========================================
开始第4个非系统盘的读写
命令->>> fio -filename=/dev/sde -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_4

mytest_4: (g=0): rw=randrw, bs=16K-16K/16K-16K/16K-16K, ioengine=psync, iodepth=1
...
fio-2.16
Starting 10 threads

mytest_4: (groupid=0, jobs=10): err= 0: pid=33211: Thu Jan  6 04:10:57 2022
  read : io=154960KB, bw=7737.1KB/s, iops=483, runt= 20026msec
    clat (usec): min=107, max=576326, avg=15242.77, stdev=37888.13
     lat (usec): min=107, max=576326, avg=15242.86, stdev=37888.13
    clat percentiles (usec):
     |  1.00th=[  274],  5.00th=[  322], 10.00th=[  370], 20.00th=[  486],
     | 30.00th=[  828], 40.00th=[ 1288], 50.00th=[ 1560], 60.00th=[ 2024],
     | 70.00th=[ 2768], 80.00th=[17024], 90.00th=[49408], 95.00th=[82432],
     | 99.00th=[177152], 99.50th=[234496], 99.90th=[374784], 99.95th=[428032],
     | 99.99th=[577536]
  write: io=152192KB, bw=7599.8KB/s, iops=474, runt= 20026msec
    clat (usec): min=143, max=383420, avg=5517.04, stdev=8618.31
     lat (usec): min=144, max=383421, avg=5517.38, stdev=8618.32
    clat percentiles (usec):
     |  1.00th=[  209],  5.00th=[  318], 10.00th=[  556], 20.00th=[ 1368],
     | 30.00th=[ 2256], 40.00th=[ 3184], 50.00th=[ 4192], 60.00th=[ 5536],
     | 70.00th=[ 7008], 80.00th=[ 8640], 90.00th=[10816], 95.00th=[12736],
     | 99.00th=[17536], 99.50th=[24960], 99.90th=[134144], 99.95th=[156672],
     | 99.99th=[382976]
    lat (usec) : 250=1.30%, 500=13.79%, 750=5.25%, 1000=2.32%
    lat (msec) : 2=20.64%, 4=17.99%, 10=20.37%, 20=8.64%, 50=4.59%
    lat (msec) : 100=3.13%, 250=1.76%, 500=0.20%, 750=0.02%
  cpu          : usr=0.02%, sys=0.08%, ctx=19197, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=9685/w=9512/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=154960KB, aggrb=7737KB/s, minb=7737KB/s, maxb=7737KB/s, mint=20026msec, maxt=20026msec
  WRITE: io=152192KB, aggrb=7599KB/s, minb=7599KB/s, maxb=7599KB/s, mint=20026msec, maxt=20026msec

Disk stats (read/write):
  sde: ios=9677/9442, merge=0/0, ticks=144833/52077, in_queue=197622, util=98.95%
==========================================
>>> 4个非系统盘的读写已完成
系统盘为>> sda
========== 开始对系统盘进行读测试 =============
命令->>> fio -directory=/test -direct=1 -iodepth 1 -thread -rw=randread -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_0

mytest_0: (g=0): rw=randread, bs=16K-16K/16K-16K/16K-16K, ioengine=psync, iodepth=1
...
fio-2.16
Starting 10 threads

mytest_0: (groupid=0, jobs=10): err= 0: pid=34501: Thu Jan  6 04:11:17 2022
  read : io=7283.2MB, bw=372880KB/s, iops=23304, runt= 20001msec
    clat (usec): min=153, max=825, avg=428.18, stdev=59.24
     lat (usec): min=153, max=825, avg=428.27, stdev=59.24
    clat percentiles (usec):
     |  1.00th=[  286],  5.00th=[  322], 10.00th=[  342], 20.00th=[  390],
     | 30.00th=[  406], 40.00th=[  418], 50.00th=[  430], 60.00th=[  442],
     | 70.00th=[  454], 80.00th=[  470], 90.00th=[  498], 95.00th=[  524],
     | 99.00th=[  580], 99.50th=[  604], 99.90th=[  660], 99.95th=[  684],
     | 99.99th=[  724]
    lat (usec) : 250=0.18%, 500=90.61%, 750=9.21%, 1000=0.01%
  cpu          : usr=0.46%, sys=2.69%, ctx=466141, majf=0, minf=56
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=466123/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=7283.2MB, aggrb=372879KB/s, minb=372879KB/s, maxb=372879KB/s, mint=20001msec, maxt=20001msec

Disk stats (read/write):
    dm-0: ios=461127/0, merge=0/0, ticks=192752/0, in_queue=192785, util=98.91%, aggrios=466123/44, aggrmerge=0/5, aggrticks=195026/12, aggrin_queue=194939, aggrutil=98.86%
  sda: ios=466123/44, merge=0/5, ticks=195026/12, in_queue=194939, util=98.86%
================  2022-01-06 04:11:17  =======================